# Prince
# 101916056
# 2cs10
# assignment 7
# असाइनमेंट 7

In [ ]:
#tables are created here 
# तालिकाएँ यहाँ बनाई गई हैं
CREATE TABLE Salespeople 
( 
  snum   integer PRIMARY KEY, 
  sname CHAR(10) unique, 
  city      CHAR(10), 
  comm  NUMBER(10,2) 
);
CREATE TABLE Customers 
( 
  cnum   integer PRIMARY KEY, 
  cname char(10) , 
  city      CHAR(10) not null, 
  snum integer REFERENCES Salespeople 
);
CREATE TABLE orders 
( 
  onum   integer PRIMARY KEY, 
  amt      DECIMAL, 
  odate   DATE NOT NULL, 
  cnum   INTEGER , 
  snum   INTEGER , 
  FOREIGN KEY (snum) REFERENCES Salespeople, 
  FOREIGN KEY (cnum) REFERENCES Customers 
);
INSERT INTO Salespeople VALUES (1001,'Peel','London',.12);
INSERT INTO Salespeople VALUES (1002,'Serres','Sanjose',.13);
INSERT INTO Salespeople VALUES (1004,'Motika','Landon',.11);
INSERT INTO Salespeople VALUES (1007,'Rifkin','Barcelona',.15);
INSERT INTO Salespeople VALUES (1003,'Axelrod','Newyork',.10);
INSERT INTO Salespeople VALUES (1009,'Rafale','Barcelona',.15);
INSERT INTO Salespeople VALUES (1008,'Axe','Newyork',.10);
INSERT INTO Salespeople VALUES (1011,'chapsi','Newyork',.11);
INSERT INTO Customers VALUES (2001,'Hoffman','London',1001);
INSERT INTO Customers  VALUES (2002,'Giovanni','Rome',1003);
INSERT INTO Customers VALUES (2003,'Liu','Sanjose',1002);
INSERT INTO Customers  VALUES (2004,'Grass','Berlin',1002);

INSERT INTO Customers VALUES (2006,'clements','London',1001);
INSERT INTO Customers  VALUES (2008,'Cisneros','Sanjose',1007);
INSERT INTO Customers VALUES (2007,'Pereira','Rome',1004);
select * from Customers;
INSERT INTO orders VALUES (3001,18.69,'3-10-1990',2008,1007);
INSERT INTO orders VALUES (3003,767.19,'3-10-1990',2001,1001);
INSERT INTO orders VALUES (3002,1900.10,'3-10-1990',2007,1004);

INSERT INTO orders VALUES (3005,5160.45,'3-oct-1990',2003,1002);
INSERT INTO orders VALUES (3006,1098.16,'3-oct-1990',2008,1007);
INSERT INTO orders VALUES (3009,1713.23,'4-oct-1990',2002,1003);
INSERT INTO orders VALUES (3007,75.75,'4-oct-1990',2004,1002);
INSERT INTO orders VALUES (3008,4273.00,'5-oct-1990',2006,1001);
INSERT INTO orders VALUES (3010,1309.95,'6-oct-1990',2004,1002);
INSERT INTO orders VALUES (3011,9891.88,'6-oct-1990',2006,1001);

INSERT INTO orders VALUES (300,5160.45,'3-oct-1990',2003,1002);
select * from salespeople;
select * from orders;
select * from customers;

In [ ]:
--q1
--1) Count the number of Salesperson whose name begin with ‘a’/’A’.
select count(*) from salespeople where sname like 'a%' or sname like 'A%';

#### output  उत्पादन

In [ ]:
COUNT(*)
2

In [ ]:

--2) Display all the Salesperson whose all orders worth is more than Rs. 2000.
--q2   next both queries are correct अगले दोनों उत्तर सही हैं 
select sname from salespeople where snum in (select snum from orders group by snum having sum(amt)>2000);
select distinct s.sname from salespeople s join orders o on (s.snum=o.snum) group by sname having sum(o.amt)>2000;

#### output  उत्पादन

In [ ]:
SNAME
Serres
Peel

In [ ]:
--q3
--3) Count the number of Salesperson belonging to Newyork.
select count(*) from salespeople where city='Newyork';

#### output उत्पादन

In [ ]:
COUNT(*)
3

In [ ]:

--4) Display the number of Salespeople belonging to Landon and belonging to Paris.
--q4
select count(*) from salespeople where city in ('Landon','Paris');

#### output उत्पादन

In [ ]:
COUNT(*)
1

In [ ]:

--5) Display the number of orders taken by each Salesperson and their date of orders.
--q5
select sum(select s.sname,o.snum,count(o.onum),o.odate from orders o full outer join salespeople s on (s.snum=o.snum) group by distinct s.sname,o.snum,o.odate) from salespeople group by sname;  --missing expression  नामौजूद अभिव्यक्ति

#### output उत्पादन

In [ ]:

--6) Write a query that counts the number of Salespeople registering orders for each day.
--q6
select odate,count(distinct snum)  from orders group by odate;

#### output उत्पादन

In [ ]:
ODATE	    COUNT(DISTINCTSNUM)
04-OCT-90	2
06-OCT-90	2
05-OCT-90	1
03-OCT-90	2

In [ ]:

--7) Write a query that selects the first customer in alphabetical order ,  whose name begins with ‘G’.
--q7
select * from customers where cname like 'G%' order by cname FETCH FIRST 1 ROWS ONLY;

#### output उत्पादन

In [ ]:
CNUM	CNAME	    CITY	    SNUM
2002	Giovanni  	Rome      	1003

In [ ]:

--8) Find out the largest orders for Snum 1002 & 1007.
--q8
select max(amt) from orders group by snum having snum in (1002,1007);

#### output उत्पादन

In [ ]:
MAX(AMT)
1098
5160

In [ ]:

--9) Find out the maximum single order amount of a Salesperson over Rs. 3000 in a day.
--q9  -- both are correct in different sense of question दोनों अलग-अलग अर्थों में सही हैं

SELECT snum, max(amt) FROM orders
   GROUP BY snum having max(amt)>3000;

select max(amt) from orders;

#### output उत्पादन

In [ ]:
SNUM	MAX(AMT)
1002	5160
1001	9892

In [ ]:
MAX(AMT)
9892

In [ ]:

--10) Find out the no. of Salesperson who belongs to same city and  have same commission percentage.

--q10  both queries are correct becuase group by( city, comm) is same as group by city, comm 


select count(city),city,comm from salespeople group by (city, comm) having count(city)>1 ;

select city ,comm,count(city),count(comm) from salespeople group by city,comm having count(city)>1 and count(comm)>1;

#### output उत्पादन

In [ ]:
COUNT(CITY)	CITY	    COMM
2	        Newyork   	.1
2	        Barcelona 	.15

# Assignment 8

In [ ]:
----------- q1 1-Find those salesperson name who live in any one of the city of customers
--(do it both with sub-query and join)
-- join

select distinct sname  from salespeople inner join  customers on salespeople.city=customers.city;

--or 
select distinct s1.snum ,s1.sname from salespeople s1,customers c1 where s1.city=c1.city;


-- subquery सबक्वेरी

select sname from salespeople where city in (select city from customers);

#### output उत्पादन

In [ ]:
SNUM	SNAME
1002	Serres    
1001	Peel

In [ ]:

---------------q2
--2-Find those salesperson name,customers name who belong to any one of the 
--city of customers
--(do it both with sub-query and join)

-- subquery    मैंने एक कॉलम में आउटपुट प्राप्त करने के लिए यूनियन  का उपयोग और डुप्लिकेट को निकालने के लिए किया।

select distinct c1.cname as name from salespeople s1 , customers c1 where c1.city = any(select city from salespeople)  union all
select distinct s1.sname from salespeople s1 , customers c1 where s1.city = any(select city from customers);   


--join  मैंने एक कॉलम में आउटपुट प्राप्त करने के लिए यूनियन का उपयोग किया।

select s1.sname as name from salespeople s1,customers c1 where s1.city=c1.city  union  
select c1.cname  as name from salespeople s1,customers c1 where s1.city=c1.city;

#### output उत्पादन

In [ ]:
# subquery 
NAME
Liu       
clements  
Hoffman   
Cisneros  
Serres    
Peel

In [ ]:
# joins 
NAME
Cisneros  
Hoffman   
Liu       
Peel      
Serres    
clements

In [ ]:

---------------q3
--3-Find those salesperson name who belong to the city of their customer     --in this do we have to refer orders or not , i have done both 
--(do it both with sub-query and join)

--join
select distinct s1.snum, s1.sname from salespeople s1, customers c1 where s1.snum=c1.snum and s1.city=c1.city;
-- if we have customers and salepeople as related in orders //  ग्राहक, आदेश और salespeople संबंधित हैं

SELECT distinct orders.snum
FROM orders
JOIN salespeople
  ON orders.snum = salespeople.snum
JOIN customers
  ON orders.cnum=customers.cnum where salespeople.city=customers.city;

--subquery  // सबक्वेरी
select * from salespeople s1 where exists (select c1.snum from customers c1 where c1.city=s1.city);  --this is correlated but how to do with subquery simply // यह सहसंबद्ध है लेकिन सरलता से कैसे किया जाए

-- if we have customers and salepeople as related in orders then -- correct or not  but it is  giving right output  यह सही आउटपुट दे रहा है
select distinct s1.snum from salespeople s1 where s1.city in (select c1.city from customers c1 where c1.cnum in (select o1.cnum from orders o1 where o1.snum=s1.snum));

#### output उत्पादन

In [ ]:
# joins 
SNUM	SNAME
1002	Serres    
1001	Peel

In [ ]:
#join again 
SNUM
1002
1001

In [ ]:
#coorelated subquery
SNUM	SNAME	    CITY    	COMM
1001	Peel      	London    	.12
1002	Serres    	Sanjose   	.13

In [ ]:
# coorelated subquery 
SNUM
1001
1002

In [ ]:

---------------q4
--4-Find those salesperson name who belong to the city of their customer
--(do it with co-related sub-query)
-- same as above   ऊपर की तरह

In [ ]:

-----------------q5
--5-Find those salesperson name,customer name where salesperson is 
--assigned/not assigned to any customer
select s1.sname , c1.cname from salespeople s1 right outer join customers c1 on s1.snum =c1.snum ;

#### output उत्पादन

In [ ]:
SNAME	    CNAME
Peel      	Hoffman   
Peel      	clements  
Serres    	Liu       
Serres    	Grass     
Motika    	Pereira   
Rifkin    	Cisneros  
Axelrod   	Giovanni  
 - 	        clements

In [ ]:

----------------q6
--6-Find those customer name who is not assigned to any salesperson

INSERT INTO Customers VALUES (2012,'clements','London',null);
select cname from customers where snum is null;

#### output  उत्पादन

In [ ]:
clements

In [ ]:

----------------q7
--7-Find the highest order of each salesperson
select max(amt),snum from orders group by snum ;

#### output  उत्पादन

In [ ]:
MAX(AMT)	SNUM
1098	1007
5160	1002
9892	1001
1713	1003

In [ ]:

-----------------q8
--8-Find the names of salesperson and their highest order
select max(o1.amt),(select s2.sname from salespeople s2 where s2.snum=o1.snum ) from orders o1  join  salespeople s1 on o1.snum=s1.snum group by o1.snum ; --this is correct 
select s1.sname, (select max(o1.amt) from orders o1 group by o1.snum having o1.snum=s1.snum) from salespeople s1;   -- this is also correct //यह भी सही है

#### output  उत्पादन

In [ ]:
Peel      	9892
Serres    	5160
Motika    	 - 
Rifkin    	1098
Axelrod   	1713
Rafale    	 - 
Axe       	 - 
chapsi    	 -

In [ ]:
-----------------q9
--9-Find those orders of salesperson which is more than his average orders

select amt from orders where exists (select amt from orders group by snum having amt>avg(amt));  --i cannot use this beacause amt > avg(amt) not a group by expression 

select o1.amt from orders o1 where o1.amt> (select avg(o2.amt) from orders o2 group by o2.snum having o2.snum=o1.snum);   --this is correct यह सही है

#### output  उत्पादन

In [ ]:
AMT
5160
9892
5160

In [ ]:

------------------q10
--10-List those salesperson who has more than two customers.
--(use all 3 methods)

--  join
-- joins + coorelated subqueries 
select count(c1.snum), (select s1.sname from salespeople s1 where s1.snum = c1.snum ) from customers c1 inner join salespeople s1 on s1.snum=c1.snum group by  c1.snum having count(c1.snum)>1;  --correct 

-- purely joins but not working --ज्वाइन कर लिया है लेकिन  काम नहीं कर रहा है यह क्वेरी हमारे साथ धोखा कर रही है 
select s1.sname from customers c1 inner join salespeople s1 on s1.snum=c1.snum group by  c1.snum having count(c1.snum)>1;     --यह काम क्यों नहीं कर रही है   in this dont use s1.sname , use s1.snum 

-- select s1.snum from customers c1 inner join salespeople s1 on s1.snum=c1.snum group by c1.snum having count(c1.snum)>2;

-- purely joins   यह शुद्ध जुड़ाव है
select s1.sname, count(s1.sname)  from salespeople s1 inner join customers c1 on s1.snum=c1.snum  group by s1.sname having count(s1.sname)>1;  --correct

-- subquery   सबक्वेरी
select * from salespeople where snum in (select snum from customers group by snum having count(snum)>1);

--coorelated subquery   सहसंबद्ध सबक्वेरी
select count(c1.snum), (select s1.sname from salespeople s1 where  s1.snum = c1.snum) from customers c1 group by (snum ) having count(c1.snum)>1;

#### output उत्पादन

In [ ]:
SNUM
1001
1002

2	Peel      
2	Serres